def area(a, b):
    """
    Вычисляет площадь прямоугольника по заданным длинам сторон a и b.

    Параметры:
        a (float): длина стороны a
        b (float): длина стороны b

    Возвращаемое значение:
        float: площадь прямоугольника

    Пример вызова:
        area(4, 5) -> 20
    """
    return a * b 


def perimeter(a, b): 
    """
    Вычисляет периметр прямоугольника по заданным длинам сторон a и b.

    Параметры:
        a (float): длина стороны a
        b (float): длина стороны b

    Возвращаемое значение:
        float: периметр прямоугольника

    Пример вызова:
        perimeter(4, 5) -> 18
    """
    return 2 * (a + b) 
